package top.kodesource.exercise_1;
/*1. Напишите программу на Java, которая напечатает «Hello» на экране, а затем напечатайте свое имя в отдельной строке.
*/

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello\nAlexandr");
    }
}
