/*
 Напишите программу на Java, чтобы разделить два числа и напечатать на экране.
Тестовые данные:
50/3
Ожидаемый результат :
16
*/
package top.kodesource.exercise_3;

public class Main {
    public static void main(String[] args) {
        int a = 50;
        int b = 3;

        System.out.println(a / b);
    }
}
