
//*Напишите программу на Java для вывода суммы двух чисел.
//Тестовые данные:
//74 + 36
//Ожидаемый результат :
//110

package top.kodesource.exercise_2;

public class Main {
    public static void main(String[] args) {
        int a = 74;
        int b = 36;

        System.out.println(a + b);
    }

}
